#ifndef _A4950_H_
#define _A4950_H_

#include "BSP\bsp_pwm.h"

/*******************************************************************
 * a4950.c
 * a4950.h
 * 功能:
 * 驱动多块a4950,每块a4950能驱动一个直流电机。
 * 关于移植:
 * 需要自定义a4950的标号和设置每块a4950的2个PWM通道
 * 需要对接port_PWMOut()和port_PWMRead()
 * 需要设置最大PWM输出,a4950数量等
 * 2022/3/19   庞碧璋
 *******************************************************************/

void A4950_Out(uint8_t a4950_id,int out);
int A4950_ReadOut(uint8_t a4950_id);
void A4950_Brake(uint8_t a4950_id);

#endif

